STMicroelectronics/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/gcc/startup_stm32mp2xx_a35.c
/*----------------------------------------------------------------------------
  Interrupt Handlers Table :
  WARNING ! "_IRQHandler" name suffix is inherited from MCU products (used in MCU HAL)
            THIS DOESN'T MEAN THAT ALL INTERRUPTS ARE ROUTED THROUGH IRQ LINE
            BETWEEN GIC400 AND CPU !
            (see SystemInit() implementation for design details about interrupts
             management through IRQ and FIQ lines)
 *----------------------------------------------------------------------------*/
IRQHandler_t Interrupt_Handlers_Table[MAX_IRQ_n] = {
   /* Software Generated Interrupts */
   SGI0_IRQHandler,                    /* 0 */
   SGI1_IRQHandler,
   SGI2_IRQHandler,
   SGI3_IRQHandler,
   SGI4_IRQHandler,
   SGI5_IRQHandler,
   SGI6_IRQHandler,
   SGI7_IRQHandler,
   SGI8_IRQHandler,
   SGI9_IRQHandler,
   SGI10_IRQHandler,                   /* 10 */
   SGI11_IRQHandler,
   SGI12_IRQHandler,
   SGI13_IRQHandler,
   SGI14_IRQHandler,
   SGI15_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,                /* 20 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   /* Private Peripheral Interrupts */
   RESERVED_IRQHandler,                /* 25 */
   HypervisorTimer_IRQHandler,
   VirtualTimer_IRQHandler,
   RESERVED_IRQHandler,
   SecurePhysicalTimer_IRQHandler,
   NonSecurePhysicalTimer_IRQHandler,  /* 30 */
   RESERVED_IRQHandler,
   /******  STM32 specific Interrupt Numbers **************************************/
   /* External interrupts according to                                            */
   /* "Table 234. STM32MP25xx interrupt mapping for Cortex-A35"                   */
   /* in chapitre 32 "interrupt list" of reference document                       */
   /* RM0457 - Reference Manual - STM32MP25xx - advanced ARM-based 32/64-bit MPUs */
   /* file "DM00485804 (RM0457) Rev0.2.pdf" (Revision 0.2 / 27-Jul-2021)          */
   /*******************************************************************************/
   PVD_IRQHandler,
   PVM_IRQHandler,
   IWDG1_IRQHandler,
   IWDG2_IRQHandler,                   /* 35 */
   IWDG3_RST_IRQHandler,
   IWDG2_RST_IRQHandler,
   IWDG4_RST_IRQHandler,
   IWDG5_RST_IRQHandler,
   RESERVED_IRQHandler,                /* 40 */
   RESERVED_IRQHandler,
   WWDG1_RST_IRQHandler,
   WWDG2_RST_IRQHandler,
   TAMP_IRQHandler,
   RTC_IRQHandler,                     /* 45 */
   TAMP_S_IRQHandler,
   RTC_S_IRQHandler,
   RCC_IRQHandler,
   EXTI2_0_IRQHandler,
   EXTI2_1_IRQHandler,                 /* 50 */
   EXTI2_2_IRQHandler,
   EXTI2_3_IRQHandler,
   EXTI2_4_IRQHandler,
   EXTI2_5_IRQHandler,
   EXTI2_6_IRQHandler,                 /* 55 */
   EXTI2_7_IRQHandler,
   EXTI2_8_IRQHandler,
   EXTI2_9_IRQHandler,
   EXTI2_10_IRQHandler,
   EXTI2_11_IRQHandler,                /* 60 */
   EXTI2_12_IRQHandler,
   EXTI2_13_IRQHandler,
   EXTI2_14_IRQHandler,
   EXTI2_15_IRQHandler,
   HPDMA1_Channel0_IRQHandler,         /* 65 */
   HPDMA1_Channel1_IRQHandler,
   HPDMA1_Channel2_IRQHandler,
   HPDMA1_Channel3_IRQHandler,
   HPDMA1_Channel4_IRQHandler,
   HPDMA1_Channel5_IRQHandler,         /* 70 */
   HPDMA1_Channel6_IRQHandler,
   HPDMA1_Channel7_IRQHandler,
   HPDMA1_Channel8_IRQHandler,
   HPDMA1_Channel9_IRQHandler,
   HPDMA1_Channel10_IRQHandler,        /* 75 */
   HPDMA1_Channel11_IRQHandler,
   HPDMA1_Channel12_IRQHandler,
   HPDMA1_Channel13_IRQHandler,
   HPDMA1_Channel14_IRQHandler,
   HPDMA1_Channel15_IRQHandler,        /* 80 */
   HPDMA2_Channel0_IRQHandler,
   HPDMA2_Channel1_IRQHandler,
   HPDMA2_Channel2_IRQHandler,
   HPDMA2_Channel3_IRQHandler,
   HPDMA2_Channel4_IRQHandler,         /* 85 */
   HPDMA2_Channel5_IRQHandler,
   HPDMA2_Channel6_IRQHandler,
   HPDMA2_Channel7_IRQHandler,
   HPDMA2_Channel8_IRQHandler,
   HPDMA2_Channel9_IRQHandler,         /* 90 */
   HPDMA2_Channel10_IRQHandler,
   HPDMA2_Channel11_IRQHandler,
   HPDMA2_Channel12_IRQHandler,
   HPDMA2_Channel13_IRQHandler,
   HPDMA2_Channel14_IRQHandler,        /* 95 */
   HPDMA2_Channel15_IRQHandler,
   HPDMA3_Channel0_IRQHandler,
   HPDMA3_Channel1_IRQHandler,
   HPDMA3_Channel2_IRQHandler,
   HPDMA3_Channel3_IRQHandler,        /* 100 */
   HPDMA3_Channel4_IRQHandler,
   HPDMA3_Channel5_IRQHandler,
   HPDMA3_Channel6_IRQHandler,
   HPDMA3_Channel7_IRQHandler,
   HPDMA3_Channel8_IRQHandler,        /* 105 */
   HPDMA3_Channel9_IRQHandler,
   HPDMA3_Channel10_IRQHandler,
   HPDMA3_Channel11_IRQHandler,
   HPDMA3_Channel12_IRQHandler,
   HPDMA3_Channel13_IRQHandler,       /* 110 */
   HPDMA3_Channel14_IRQHandler,
   HPDMA3_Channel15_IRQHandler,
   LPDMA_Channel0_IRQHandler,
   LPDMA_Channel1_IRQHandler,
   LPDMA_Channel2_IRQHandler,         /* 115 */
   LPDMA_Channel3_IRQHandler,
   ICACHE_IRQHandler,
   DCACHE_IRQHandler,
   ADC1_IRQHandler,
   ADC2_IRQHandler,                   /* 120 */
   ADC3_IRQHandler,
   FDCAN_CAL_IRQHandler,
   FDCAN1_IT0_IRQHandler,
   FDCAN2_IT0_IRQHandler,
   FDCAN3_IT0_IRQHandler,             /* 125 */
   FDCAN1_IT1_IRQHandler,
   FDCAN2_IT1_IRQHandler,
   FDCAN3_IT1_IRQHandler,
   TIM1_BRK_IRQHandler,
   TIM1_UP_IRQHandler,                /* 130 */
   TIM1_TRG_COM_IRQHandler,
   TIM1_CC_IRQHandler,
   TIM20_BRK_IRQHandler,
   TIM20_UP_IRQHandler,
   TIM20_TRG_COM_IRQHandler,          /* 135 */
   TIM20_CC_IRQHandler,
   TIM2_IRQHandler,
   TIM3_IRQHandler,
   TIM4_IRQHandler,
   I2C1_IRQHandler,                   /* 140 */
   I3C1_IRQHandler,
   I2C2_IRQHandler,
   I3C2_IRQHandler,
   SPI1_IRQHandler,
   SPI2_IRQHandler,                   /* 145 */
   USART1_IRQHandler,
   USART2_IRQHandler,
   USART3_IRQHandler,
   VDEC_IRQHandler,
   TIM8_BRK_IRQHandler,               /* 150 */
   TIM8_UP_IRQHandler,
   TIM8_TRG_COM_IRQHandler,
   TIM8_CC_IRQHandler,
   FMC_IRQHandler,
   SDMMC1_IRQHandler,                 /* 155 */
   TIM5_IRQHandler,
   SPI3_IRQHandler,
   UART4_IRQHandler,
   UART5_IRQHandler,
   TIM6_IRQHandler,                   /* 160 */
   TIM7_IRQHandler,
   ETH1_SBD_IRQHandler,
   ETH1_PMT_IRQHandler,
   ETH1_LPI_IRQHandler,
   ETH2_SBD_IRQHandler,               /* 165 */
   ETH2_PMT_IRQHandler,
   ETH2_LPI_IRQHandler,
   USART6_IRQHandler,
   I2C3_IRQHandler,
   I3C3_IRQHandler,                   /* 170 */
   USBH_EHCI_IRQHandler,
   USBH_OHCI_IRQHandler,
   DCMI_PSSI_IRQHandler,
   CSI_IRQHandler,
   DSI_IRQHandler,                    /* 175 */
#if defined(STM32MP257Cxx)
   CRYP1_IRQHandler,
#else /* STM32MP257Cxx */
   RESERVED_IRQHandler,
#endif /* else STM32MP257Cxx */
   HASH_IRQHandler,
   PKA_IRQHandler,
   RESERVED_IRQHandler,
   UART7_IRQHandler,                  /* 180 */
   UART8_IRQHandler,
   UART9_IRQHandler,
   LPUART1_IRQHandler,
   SPI4_IRQHandler,
   SPI5_IRQHandler,                   /* 185 */
   SPI6_IRQHandler,
   SPI7_IRQHandler,
   SPI8_IRQHandler,
   SAI1_IRQHandler,
   LTDC_IRQHandler,                   /* 190 */
   LTDC_ER_IRQHandler,
   LTDC_SEC_IRQHandler,
   LTDC_SEC_ER_IRQHandler,
   SAI2_IRQHandler,
   OCTOSPI1_IRQHandler,               /* 195 */
   OCTOSPI2_IRQHandler,
   OTFDEC1_IRQHandler,
   LPTIM1_IRQHandler,
   VENC_IRQHandler,
   I2C4_IRQHandler,                   /* 200 */
   USBH_WAKEUP_IRQHandler,
   SPDIFRX_IRQHandler,
   IPCC1_RX_IRQHandler,
   IPCC1_TX_IRQHandler,
   IPCC1_RX_S_IRQHandler,             /* 205 */
   IPCC1_TX_S_IRQHandler,
   IPCC2_RX_IRQHandler,
   IPCC2_TX_IRQHandler,
   IPCC2_RX_S_IRQHandler,
   IPCC2_TX_S_IRQHandler,             /* 210 */
   SAES_IRQHandler,
#if defined(STM32MP257Cxx)
   CRYP2_IRQHandler,
#else /* STM32MP257Cxx */
   RESERVED_IRQHandler,
#endif /* else STM32MP257Cxx */
   I2C5_IRQHandler,
   USB3DR_WAKEUP_IRQHandler,
   GPU_IRQHandler,                    /* 215 */
   MDF1_FLT0_IRQHandler,
   MDF1_FLT1_IRQHandler,
   MDF1_FLT2_IRQHandler,
   MDF1_FLT3_IRQHandler,
   MDF1_FLT4_IRQHandler,              /* 220 */
   MDF1_FLT5_IRQHandler,
   MDF1_FLT6_IRQHandler,
   MDF1_FLT7_IRQHandler,
   SAI3_IRQHandler,
   TIM15_IRQHandler,                  /* 225 */
   TIM16_IRQHandler,
   TIM17_IRQHandler,
   TIM12_IRQHandler,
   SDMMC2_IRQHandler,
   DCMIPP_IRQHandler,                 /* 230 */
   HSEM_IRQHandler,
   HSEM_S_IRQHandler,
   RESERVED_IRQHandler,
   CPU2_SYSRESETQ_IRQHandler,
   TIM13_IRQHandler,                  /* 235 */
   TIM14_IRQHandler,
   TIM10_IRQHandler,
   RNG_IRQHandler,
   ADF1_FLT_IRQHandler,
   I2C6_IRQHandler,                   /* 240 */
   COMBOPHY_WAKEUP_IRQHandler,
   I2C7_IRQHandler,
   RESERVED_IRQHandler,
   I2C8_IRQHandler,
   I3C4_IRQHandler,                   /* 245 */
   SDMMC3_IRQHandler,
   LPTIM2_IRQHandler,
   LPTIM3_IRQHandler,
   LPTIM4_IRQHandler,
   LPTIM5_IRQHandler,                 /* 250 */
   OTFDEC2_IRQHandler,
   CPU2_SEV_IRQHandler,
   CPU3_SEV_IRQHandler,
   RCC_WAKEUP_IRQHandler,
   SAI4_IRQHandler,                   /* 255 */
   DTS_IRQHandler,
   TIM11_IRQHandler,
   CPU1_WAKEUP_PIN_IRQHandler,
   USB3DR_BC_IRQHandler,
   USB3DR_IRQHandler,                 /* 260 */
   UCPD1_IRQHandler,
   RESERVED_IRQHandler,
   PCIE_AER_IRQHandler,
   PCIE_AERM_IRQHandler,
   PCIE_BW_IRQHandler,                /* 265 */
   PCIE_BWM_IRQHandler,
   PCIE_BWAUTO_IRQHandler,
   PCIE_BWAUTOM_IRQHandler,
   PCIE_PME_IRQHandler,
   PCIE_PMEM_IRQHandler,              /* 270 */
   PCIE_SYSERR_IRQHandler,
   SERF_IRQHandler,
   BUSPERFM_IRQHandler,
   RAMCFG_IRQHandler,
   DDRCTRL_IRQHandler,                /* 275 */
   DDRPHYC_IRQHandler,
   DFI_ERR_IRQHandler,
   IAC_IRQHandler,
   VDDCPU_VD_IRQHandler,
   VDDCORE_VD_IRQHandler,             /* 280 */
   RETRAMCRC_ERR_IRQHandler,
   ETHSW_IRQHandler,
   ETHSW_MSGBUF_IRQHandler,
   ETHSW_FSC_IRQHandler,
   HPDMA1_WKUP_IRQHandler,            /* 285 */
   HPDMA2_WKUP_IRQHandler,
   HPDMA3_WKUP_IRQHandler,
   LPDMA_WKUP_IRQHandler,
   UCPD1_VBUS_IRQHandler,
   UCPD1_VSAFE5V_IRQHandler,           /* 290 */
   RCC_HSI_FMON_IRQHandler,
   VDDGPU_VD_IRQHandler,
   RESERVED_IRQHandler,
   PCIE_PTMRDY_IRQHandler,
   PCIE_PTMUPD_IRQHandler,            /* 295 */
   PCIE_INTA_IRQHandler,
   PCIE_INTB_IRQHandler,
   PCIE_INTC_IRQHandler,
   PCIE_INTD_IRQHandler,
   EXTI1_0_IRQHandler,                /* 300 */
   EXTI1_1_IRQHandler,
   EXTI1_2_IRQHandler,
   EXTI1_3_IRQHandler,
   EXTI1_4_IRQHandler,
   EXTI1_5_IRQHandler,                /* 305 */
   EXTI1_6_IRQHandler,
   EXTI1_7_IRQHandler,
   EXTI1_8_IRQHandler,
   EXTI1_9_IRQHandler,
   EXTI1_10_IRQHandler,               /* 310 */
   EXTI1_11_IRQHandler,
   EXTI1_12_IRQHandler,
   EXTI1_13_IRQHandler,
   EXTI1_14_IRQHandler,
   EXTI1_15_IRQHandler,               /* 315 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,               /* 320 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,               /* 325 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,               /* 330 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,               /* 335 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   IS2M_IRQHandler,                   /* 340 */
   L2WERR_IRQHandler,
   DDRPERFM_IRQHandler,
   RESERVED_IRQHandler,
   PMSTAT0_IRQHandler,
   PMSTAT1_IRQHandler,                /* 345 */
   PMSTAT2_IRQHandler,
   PMSTAT3_IRQHandler,
   PMSTAT4_IRQHandler,
   PMSTAT5_IRQHandler,
   PMSTAT6_IRQHandler,                /* 350 */
   PMSTAT7_IRQHandler,
   PMSTAT8_IRQHandler,
   PMSTAT9_IRQHandler,
   PMSTAT10_IRQHandler,
   PMSTAT11_IRQHandler,               /* 355 */
   PMSTAT12_IRQHandler,
   PMSTAT13_IRQHandler,
   PMSTAT14_IRQHandler,
   PMSTAT15_IRQHandler,
   PMSTAT16_IRQHandler,               /* 360 */
   PCIE_MSIGBL_IRQHandler,
   PCIE_MSI0_IRQHandler,
   PCIE_MSI1_IRQHandler,
   PCIE_MSI2_IRQHandler,
   PCIE_MSI3_IRQHandler,              /* 365 */
   PCIE_MSI4_IRQHandler,
   PCIE_MSI5_IRQHandler,
   PCIE_MSI6_IRQHandler,
   PCIE_MSI7_IRQHandler,
   PCIE_MSI8_IRQHandler,              /* 370 */
   PCIE_MSI9_IRQHandler,
   PCIE_MSI10_IRQHandler,
   PCIE_MSI11_IRQHandler,
   PCIE_MSI12_IRQHandler,
   PCIE_MSI13_IRQHandler,             /* 375 */
   PCIE_MSI14_IRQHandler,
   PCIE_MSI15_IRQHandler,
   PCIE_MSI16_IRQHandler,
   PCIE_MSI17_IRQHandler,
   PCIE_MSI18_IRQHandler,             /* 380 */
   PCIE_MSI19_IRQHandler,
   PCIE_MSI20_IRQHandler,
   PCIE_MSI21_IRQHandler,
   PCIE_MSI22_IRQHandler,
   PCIE_MSI23_IRQHandler,             /* 385 */
   PCIE_MSI24_IRQHandler,
   PCIE_MSI25_IRQHandler,
   PCIE_MSI26_IRQHandler,
   PCIE_MSI27_IRQHandler,
   PCIE_MSI28_IRQHandler,             /* 390 */
   PCIE_MSI29_IRQHandler,
   PCIE_MSI30_IRQHandler,
   PCIE_MSI31_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,               /* 395 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   PMUIRQ0_IRQHandler,                /* 400 */
   PMUIRQ1_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   COMMRX0_IRQHandler,
   COMMRX1_IRQHandler,                /* 405 */
   RESERVED_IRQHandler,
   RESERVED_IRQHandler,
   COMMTX0_IRQHandler,
   COMMTX1_IRQHandler,
   RESERVED_IRQHandler,               /* 410 */
   RESERVED_IRQHandler,
   nCTIIRQ0_IRQHandler,
   nCTIIRQ1_IRQHandler,
   RESERVED_IRQHandler,
   RESERVED_IRQHandler                /* 415 */
};

