STMicroelectronics/STM32DDRFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Source/Templates/gcc/startup_stm32mp2xx_a35.c
uint32_t g_isAarch32inEL3_flag = 1;

/*----------------------------------------------------------------------------
  Reset Handler called on controller reset
 *----------------------------------------------------------------------------*/
void Reset_Handler(void) {
#if defined(A35_STARTUP_IN_ARM_MODE)
  /* Force ARM mode (vs Thumb mode forced by build toolchain) */
  __asm__ volatile(
  ".code 32                           \n"
  "start_reset_handler:               \n");
#endif /* defined(A35_STARTUP_IN_ARM_MODE) */
  __asm__ volatile(
  /* Mask interrupts */
  "CPSID  if                                       \n"

#if !defined(NO_PARKED_A35)
  /* Put any ("slave") core other than "master" core to sleep */
  /* Read MPIDR for extracting core index */
  "MRC    p15, 0, R0, c0, c0, 5                    \n"
  "ANDS   R0, R0, #3                               \n"
#if defined(MASTER_A35_1)
  "BNE master                                      \n"
#else
  "BEQ master                                      \n"
#endif /* defined(MASTER_A35_1) */
  /* Park "slave" core in "Wait for Interrupt" */
  "goToSleep:                                      \n"
  "WFI                                             \n"
  "B      goToSleep                                \n"
  "master:                                         \n"
#endif /* !defined(NO_PARKED_A35) */

  /* Reset SCTLR Settings */
  "MRC    p15, 0, R0, c1, c0, 0                    \n"  /* Read CP15 System Control register */
  "BIC    R0, R0, #(0x1 << 12)                     \n"  /* Clear I bit 12 to disable I Cache */
  "BIC    R0, R0, #(0x1 <<  2)                     \n"  /* Clear C bit  2 to disable D Cache */
  "BIC    R0, R0, #0x1                             \n"  /* Clear M bit  0 to disable MMU */
  "BIC    R0, R0, #(0x1 << 11)                     \n"  /* Clear Z bit 11 to disable branch prediction */
  "BIC    R0, R0, #(0x1 << 13)                     \n"  /* Clear V bit 13 to disable hivecs */
  "ORR    R0, R0, #(0x1 << 30)                     \n"  /* Set TE bit to take exceptions in Thumb mode */
  "MCR    p15, 0, R0, c1, c0, 0                    \n"  /* Write value back to CP15 System Control register */
  "ISB                                             \n"

  /* Configure ACTLR */
  "MRC    p15, 0, r0, c1, c0, 1                    \n"  /* Read CP15 Auxiliary Control Register */
  "ORR    r0, r0, #(1 <<  1)                       \n"  /* Enable L2 prefetch hint (UNK/WI since r4p1) */
  "MCR    p15, 0, r0, c1, c0, 1                    \n"  /* Write CP15 Auxiliary Control Register */

  /* Set Vector Base Address Register (VBAR) to point to this application's vector table */
  "LDR    R0, =vector_table_addr                   \n"
  "MCR    p15, 0, R0, c12, c0, 0                   \n"
  );

  __asm__ volatile(
  /* Get CPSR to know whether current Aarch32 code is running in EL3 or in EL1 */
  "MRS    R3, CPSR                                 \n"
  /* When code is running in EL3 (CPSR.A bit 8 = 0b0), */
  "ANDS   R3, R3, #0x100                           \n"
  "CMP    R3, #0x100                               \n"
  "BNE    clear_Aarch32inEL3_flag                  \n"
  /* - reset Secure Configuration Register (SCR) to its reset value 0x0 */
  "LDR    R0, =0x0                                 \n"
  "MCR    p15, 0, R0, c1, c1, 0                    \n"
  /* - set Aarch32_in_EL3_flag to 1 */
  "LDR    R2, =0x1                                 \n"
  "B      end_of_CPSR_processing                   \n"
  /* else (when code is running in EL1) */
  "clear_Aarch32inEL3_flag:                        \n"
  /* - clear Aarch32_in_EL3_flag to 0 */
  "LDR    R2, =0x0                                 \n"
  "end_of_CPSR_processing:                         \n"
  "LDR    R3, =g_isAarch32inEL3_flag               \n"
  "STR    R2, [R3]                                 \n"
  );

  __asm__ volatile(
  /* Setup Stack for each exceptional mode */
  "CPS    %[fiq_mode]                              \n"
  "LDR    SP, =FIQ_STACK                           \n"
  "CPS    %[irq_mode]                              \n"
  "LDR    SP, =IRQ_STACK                           \n"
  "CPS    %[svc_mode]                              \n"
  "LDR    SP, =SVC_STACK                           \n"
  "CPS    %[abt_mode]                              \n"
  "LDR    SP, =ABT_STACK                           \n"
  "CPS    %[und_mode]                              \n"
  "LDR    SP, =UND_STACK                           \n"
  "CPS    %[sys_mode]                              \n"
  "LDR    SP, =SYS_STACK                           \n"

  /* workaround to avoid stepping issue */
  "CPS    %[svc_mode]                              \n"

  /* Initialize system : variables (before enabling MMU) and interrupts) */
  "BL     SystemInit                               \n"

  /* Configure and enable MMU & caches at EL1 (only) */
  "LDR    R1, =g_isAarch32inEL3_flag               \n"
  "LDR    R0, [R1]                                 \n"
  "ANDS   R0, R0, #1                               \n"
  "BNE    after_mmu_cache_config                   \n"
  ::[usr_mode] "M" (USR_MODE),
    [fiq_mode] "M" (FIQ_MODE),
    [irq_mode] "M" (IRQ_MODE),
    [svc_mode] "M" (SVC_MODE),
    [abt_mode] "M" (ABT_MODE),
    [und_mode] "M" (UND_MODE),
    [sys_mode] "M" (SYS_MODE));

#if !defined(NO_A35_MMU_CACHE_ENABLE)
  __asm__ volatile(
  /* Set EL1 MMU Configuration (a bit different from EL3 MMU one) */
  /* according to VMSAv8-32 long-descriptor format                */
  /* (see pages 24-26 in [ARM_DAI_0527A] )                        */
  /* - Initialize translation tables :   */
  ".extern mair0_value                             \n"
  ".extern mair1_value                             \n"
  ".extern mp2_el1_ttb0_base                       \n"
  ".extern mp2_el1_ttb1_base                       \n"
  /*   . by setting MAIR0 value */
  /*     (see G6.2.102 "MAIR0, Memory Attribute Indirection Register 0" */
  /*      in [ARM_DDI_0487B.a]  */
  /*      and B1.95 "Memory Attribute Indirection Registers 0 and 1" */
  /*      in [A35_TRM])         */
  /*     Note : only MAIR0 is needed in present code */
  "LDR     r0, =mair0_value                        \n"
  "LDR     r1, [r0]                                \n"
  "MCR     p15, 0, r1, c10, c2, 0                  \n"
  /*   . by setting MAIR1 value */
  /*     (see G6.2.103 "MAIR1, Memory Attribute Indirection Register 1" */
  /*      in [ARM_DDI_0487B.a]  */
  /*      and B1.95 "Memory Attribute Indirection Registers 0 and 1" */
  /*      in [A35_TRM])         */
  /*     Note : MAIR1 is not used in present code */
  "LDR     r0, =mair1_value                        \n"
  "LDR     r1, [r0]                                \n"
  "MCR     p15, 0, r1, c10, c2, 1                  \n"
  /*   . by setting TTBCR value */
  /*     (see G6.2.156 "TTBCR, Translation Table Base Control Register" */
  /*      in [ARM DDI 0487B.a]  */
  /*      and B1.112 "TTBCR with Long-descriptor translation table format" */
  /*      in [A35_TRM])         */
  /*      - bits   [2:0] "T0SZ" = 0b000 = 0                                  */
  /*               <=> The region size is 2^(32-T0SZ) = 2^32 bytes = 4GB.    */
  /*      - bits   [6:3] "RES0" = 0b0000                                     */
  /*      - bit      [7] "EPD0" = 0b0                                        */
  /*                 <=> "Perform translation table walks using TTBR0."      */
  /*      - bits   [9:8] "IRGN0" = 0b01                                      */
  /*                 <=> "Normal memory, Inner Write-Back Read-Allocate      */
  /*                      Write-Allocate Cacheable"                          */
  /*      - bits [11:10] "ORGN0" = 0b01                                      */
  /*                 <=> "Normal memory, Outer Write-Back Read-Allocate      */
  /*                      Write-Allocate Cacheable"                          */
  /*      - bits [13:12] "SH0" = 0b11                                        */
  /*                 <=> "Inner Shareable"                                   */
  /*      - bits [15:14] "RES0" = 0b00                                       */
  /*      - bits [18:16] "T1SZ" = 0b000 = 0                                  */
  /*                 <=> "The region size is 2(32-T1SZ) = 2^32 bytes = 4GB.  */
  /*      - bits [21:19] "RES0" = 0b000                                      */
  /*      - bit     [22] "A1" = 0b0                                          */
  /*                 <=> "TTBR0.ASID defines the ASID.                       */
  /*      - bit     [23] "EPD1" = 0b1                                        */
  /*                 <=> "A TLB miss on an address that is translated        */
  /*                      using TTBR1 generates a Translation fault.         */
  /*                      No translation table walk is performed."           */
  /*      - bits [25:24] "IRGN1" = 0b01                                      */
  /*                 <=> "Normal memory, Inner Write-Back Read-Allocate      */
  /*                      Write-Allocate Cacheable"                          */
  /*      - bits [27:26] "ORGN1" = 0b01                                      */
  /*                 <=> "Normal memory, Outer Write-Back Read-Allocate      */
  /*                      Write-Allocate Cacheable"                          */
  /*      - bits [29:28] "SH1"   = 0b11                                      */
  /*                 <=> "Inner Shareable"                                   */
  /*      - bit       30 "RES0"  = 0b0                                       */
  /*      - bit       31 "EAE"   = 0b1 "Extended Address Enable"             */
  /*                 <=> "Use the VMSAv8-32 translation system               */
  /*                      with the Long-descriptor translation table format" */
  /*      ==> 0xB580_3500                                                    */
  "LDR     r0, =0xB5803500                         \n"
  "MCR     p15, 0, r0, c2, c0, 2                   \n"
  /*   . by setting TTBR0 64-bit value   */
  /*     (see G6.2.158 "TTBR0, Translation Table Base Register 0" */
  /*      in [ARM DDI 0487B.a] */
  /*      and B1.115 "TTBR0 with Long-descriptor translation table format" */
  /*      in [A35_TRM])        */
  /*      - bits   [4:0] "RES0" ("T0SZ" = 0)                    */
  /*      - bits  [31:5] "BADDR[31:5]" = @mp2_el1_ttb0_base     */
  "LDR     r0, =mp2_el1_ttb0_base                  \n"
  /*      - bits [47:32] "BADDR[47:31]" = 0b0000_0000_0000_0000 */
  /*      - bits [55:48] "ASID" = 0b0000_0000                   */
  /*      - bits [63:56] "RES0" = 0b0000_0000                   */
  "MOV     r1, #0                                  \n"
  "MCRR    p15, 0, r0, r1, c2                      \n"
  /*   . by setting TTBR1 64-bit value   */
  /*     (see G6.2.159 "TTBR1, Translation Table Base Register 1" */
  /*      in [ARM DDI 0487B.a] */
  /*      and B1.118 "TTBR1 with Long-descriptor translation table format" */
  /*      in [A35_TRM])        */
  /*      - bits   [4:0] "RES0" ("T1SZ" = 0)                    */
  /*      - bits  [31:5] "BADDR[31:5]" = @mp2_el1_ttb1_base     */
  "LDR     r0, =mp2_el1_ttb1_base                  \n"
  /*      - bits [47:32] "BADDR[47:31]" = 0b0000_0000_0000_0000 */
  /*      - bits [55:48] "ASID" = 0b0000_0000                   */
  /*      - bits [63:56] "RES0" = 0b0000_0000                   */
  "MOV     r1, #0                                  \n"
  "MCRR    p15, 1, r0, r1, c2                      \n"
  "ISB                                             \n"

  /*************************************************************************/
  /* Note : as described in G6.2.34 "DACR, Domain Access Control Register" */
  /*        in [ARM DDI 0487B.a] and in B1.47 in [A35_TRM] :               */
  /*        "This register has no function when TTBCR.EAE is set to 1,     */
  /*         to select the Long-descriptor translation table format."      */
  /*************************************************************************/

  /* Invalidate the MMU and caches : */
  /* - Invalidate all TLB            */
  /*   (see G6.2.128 "TLBIALL, TLB Invalidate All" in [ARM_DDI_0487B.a]) */
  "MCR     p15, 0, r0, c8, c7, 0                   \n"  /* Write TLBIALL */
  "DSB                                             \n"
  "ISB                                             \n"
  /* - Invalidate instruction cache */
  /*   (see G6.2.75 "ICIALLU, Instruction Cache Invalidate All to PoU" */
  /*    in [ARM_DDI_0487B.a])       */
  "MCR     p15, 0, r0, c7, c5, 0                   \n"  /* Write ICIALLU */
  "ISB                                             \n"

